IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_SAMPLE01.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WORK-AREA.
    05 X-NUMBER PIC 9(3).
PROCEDURE DIVISION.
    MAIN    SECTION.
       MOVE 300 TO X-NUMBER.

       IF X-NUMBER = 100 THEN
            DISPLAY '等于100'
       ELSE
            DISPLAY '不等于100'
        END-IF.
    STOP RUN.