IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_SAMPLE01.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.


PROCEDURE DIVISION.
    MAIN    SECTION.

    PERFORM 5 TIMES
        DISPLAY 'HELLO'
        DISPLAY 'WORLD'
    END-PERFORM.
    STOP RUN.