IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_SAMPLE01.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WORK-AREA.
    05 LOOP-NUMBER PIC 9(3).
    05 I PIC 9(1).
PROCEDURE DIVISION.
    MAIN    SECTION.
       MOVE 1 TO LOOP-NUMBER.

    PERFORM VARYING I FROM 1 BY 2 UNTIL I > 5
        DISPLAY '現在回数：'I
    END-PERFORM
    STOP RUN.