IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_SAMPLE01.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WORK-AREA.
    05 LOOP-NUMBER PIC 9(3).
PROCEDURE DIVISION.
    MAIN    SECTION.
       MOVE 300 TO LOOP-NUMBER.

    PERFORM UNTIL LOOP-NUMBER > 50
        DISPLAY '現在回数：'LOOP-NUMBER
        ADD 1 TO LOOP-NUMBER
    END-PERFORM
    STOP RUN.