IDENTIFICATION DIVISION.
PROGRAM-ID. ADD_SAMPLE01.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
    WORKING-STORAGE SECTION.
        01 WORK-AREA.
            03 WORK-GROUP-1.
                05 WORK-NUM-1   PIC 9(3).
                05 WORK-NUM-2   PIC 9(3).
                05 WORK-SUM     PIC 9(3).
                05 WORK-SUBTRACT     PIC 9(3).
                05 WORK-MULTIPLY     PIC 9(5).
                05 WORK-DIVIDE       PIC 9(3).
                05 WORK-REMAINDER    PIC 9(3).
                05 WORK-V9           PIC 9(3)V9(3).
PROCEDURE DIVISION.
    MAIN    SECTION.
        MOVE 100 TO WORK-NUM-1.
        MOVE 200 TO WORK-NUM-2.
        
        ADD WORK-NUM-1 WORK-NUM-2 TO WORK-SUM.
        SUBTRACT WORK-NUM-1 FROM WORK-NUM-2 GIVING WORK-SUBTRACT.
        MULTIPLY WORK-NUM-2 BY WORK-NUM-1 GIVING WORK-MULTIPLY.
        DIVIDE WORK-NUM-1 INTO WORK-NUM-2 GIVING WORK-DIVIDE.
        
        MOVE 3 TO WORK-NUM-1.
        MOVE 2 TO WORK-NUM-2.
        
        
        DIVIDE WORK-NUM-1 BY WORK-NUM-2 GIVING WORK-DIVIDE REMAINDER WORK-REMAINDER.
        
        DIVIDE WORK-NUM-1 BY WORK-NUM-2 GIVING WORK-V9 REMAINDER WORK-REMAINDER.
        
        DISPLAY 'SUM：' WORK-SUM.
        DISPLAY 'SUB：' WORK-SUBTRACT.
        DISPLAY 'MULTIPLY：' WORK-MULTIPLY.
        DISPLAY 'DIVIDE：' WORK-DIVIDE.
        DISPLAY 'REMAINDER：' WORK-REMAINDER.
        DISPLAY 'V9：' WORK-V9.
        
    STOP RUN.