IDENTIFICATION DIVISION.
PROGRAM-ID. LOOP_SAMPLE01.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 I PIC 9(3).
01 J PIC 9(3).
01 RESULT PIC 9(3).
PROCEDURE DIVISION.
    MAIN    SECTION.
    
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 9
        PERFORM VARYING J FROM 1 BY 1 UNTIL J > 9
            MULTIPLY I BY J GIVING RESULT
            DISPLAY I " X " J " = "RESULT
        END-PERFORM
    END-PERFORM.
    STOP RUN.