       IDENTIFICATION DIVISION.
       PROGRAM-ID. LENGTH-FUNCTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FIRST-TEXT PIC X(30).
       01 SECOND-TEXT PIC A(10).
       01 THIRD-TEXT PIC 9(20).

       PROCEDURE DIVISION.
           DISPLAY "文字列：" FIRST-TEXT.
           DISPLAY "長さは：" FUNCTION LENGTH(FIRST-TEXT).

           DISPLAY "A：" SECOND-TEXT.
           DISPLAY "長さは：" FUNCTION LENGTH(SECOND-TEXT).

           DISPLAY "数値：" THIRD-TEXT.
           DISPLAY "長さは：" FUNCTION LENGTH(THIRD-TEXT).
           STOP RUN.
           