       01 CUSTOMER-RECORD.
           05 CUST-ID      PIC X(10).
           05 CUST-NAME    PIC X(20).
           05 CUST-AGE     PIC 9(3).
           